# Table of Contents
- Import libraries

- Import Data

- Data Wrangling

- Missing Values

- Duplicates

- Mixed Data Types

- Combine Data

- Export Data

# 01. Importing Libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

# 02. Importing Data

In [2]:
# Define path
path = r'C:\Users\tom\Documents\Career Foundry\2022-05-29 Instacart Basket Analysis'

In [3]:
# Import Customers Data
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [4]:
# Import Order Products Merged Data
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged.pkl'))

# 03. Data Wrangling

In [5]:
# Check the output
df_cust.shape

(206209, 10)

In [6]:
# Original customers dataframe
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

There are inconsistences with how the columns are named, so I will change these to be more uniform, whilst also being appropriate for what data the column actually contains.

In [7]:
# Rename 'First Name' column to 'first_name'
df_cust.rename(columns = {'First Name': 'first_name'}, inplace=True)

In [8]:
# Rename 'Surnam' column to 'last_name'
df_cust.rename(columns = {'Surnam': 'last_name'}, inplace=True)

In [9]:
# Rename 'Gender' column to 'gender'
df_cust.rename(columns = {'Gender': 'gender'}, inplace=True)

In [10]:
# Rename 'STATE' column to 'state'
df_cust.rename(columns = {'STATE': 'state'}, inplace=True)

In [11]:
# Rename 'Age' column to 'age'
df_cust.rename(columns = {'Age': 'age'}, inplace=True)

In [12]:
# Rename 'n_dependants' column to 'number_of_dependants'
df_cust.rename(columns = {'n_dependants': 'number_of_dependants'}, inplace=True)

In [13]:
# Rename 'fam_status' column to 'marital_status'
df_cust.rename(columns = {'fam_status': 'marital_status'}, inplace=True)

In [14]:
# Customers dataframe with updated column names
df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# 04. Missing Values

In [15]:
# Find columns with missing values
df_cust.isnull().sum()

user_id                     0
first_name              11259
last_name                   0
gender                      0
state                       0
age                         0
date_joined                 0
number_of_dependants        0
marital_status              0
income                      0
dtype: int64

In [16]:
# Create nan subset for missing first names
df_nan = df_cust[df_cust['first_name'].isnull() == True]

In [17]:
# View nan subset
df_nan

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

The missing first names do not really affect anything, so I will be leaving them in.

# 05. Duplicates

In [18]:
# Check for duplicates
df_cust[df_cust.duplicated()]

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_of_dependants, marital_status, income]
Index: []

There are no duplicates in the dataframe.

# 06. Mixed Data Types

In [19]:
# Check for mixed data types
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

first_name

In [20]:
# Re-assign 'first_name' to string data type
df_cust['first_name'] = df_cust['first_name'].astype('str')

In [21]:
# View data types
df_cust.dtypes

user_id                  int64
first_name              object
last_name               object
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependants     int64
marital_status          object
income                   int64
dtype: object

In [22]:
# Check final dataframe
df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# 07. Combine Data

In [23]:
# Check the shape
ords_prods_merge.shape

(32404859, 20)

In [24]:
# Check the output
ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,_merge,product_name,aisle_id,department_id,prices,max_order,loyalty_flag,user_spending,spending_flag,order_frequency,order_frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,both,Soda,77,7,9.0,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,196,1,1,both,Soda,77,7,9.0,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,196,1,1,both,Soda,77,7,9.0,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,196,1,1,both,Soda,77,7,9.0,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,196,1,1,both,Soda,77,7,9.0,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [25]:
# Merge customer dataframe with orders/products dataframe
ords_prods_cust = ords_prods_merge.merge(df_cust, on = 'user_id')

In [26]:
# Check the shape
ords_prods_cust.shape

(32404859, 29)

In [27]:
# Drop _merge column
ords_prods_all = ords_prods_cust.drop('_merge', 1)

C:\Users\tom\AppData\Local\Temp\ipykernel_31592\1109923885.py:2: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  ords_prods_all = ords_prods_cust.drop('_merge', 1)

# 08. Export Data

In [28]:
df_cust.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'customer_updated.pkl'))

In [30]:
ords_prods_all.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_all.pkl'))